Revit 2027 API
XYZ.DotProduct Method
The dot product of this vector and the specified vector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DotProduct(
	XYZ source
)
Public Function DotProduct (
	source As XYZ
) As Double
public:
double DotProduct(
	XYZ^ source
)
member DotProduct :
        source : XYZ -> float
Parameters
source XYZ
The vector to multiply with this vector.
Return Value
Double
The real number equal to the dot product.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
Remarks
 The dot product is the sum of the respective coordinates of the two vectors: Vx*Wx + Vy*Wy + Vz*Wz. Also known as scalar product or inner product.
See Also
Reference
XYZ Class
Autodesk.Revit.DB Namespace